#format( )方法的格式控制
#{<参数序号>:<格式控制标记>}
'''
 ; 引导符号
 <填充> 用于填充的单位字符
 <对齐> <左对齐 >右对齐 ^居中对齐
 <宽度> 槽的设定输出宽度
 <，> 数字的千位分隔符，适用于整数和浮点数
 <精度> 浮点数小数部分的精度或字符串的最大输出长度
 <类型> 整数类型b,c,d,o,x,X 浮点数类型e,E,f,%
'''

s = "二级考试"
print("{0:25}".format(s))#空格填充
print("{0:1}".format(s))#小于仍然原样输出
print("{0:^25}".format(s))#          二级考试           .
print("{0:>25}".format(s))#                     二级考试
print("{0:*^25}".format(s))#**********二级考试***********
print("{0:+^25}".format(s))#++++++++++二级考试+++++++++++

y = "+"

print("{0:{1}^25}".format(s,y))#++++++++++二级考试+++++++++++
print("{0:{1}^{2}}".format(s,y,28))#++++++++++++二级考试++++++++++++
print("{0:{1}{2}{3}}".format(s,y,"^",28))#++++++++++++二级考试++++++++++++

print("{:-^25,}".format(234567890))#非字符串

print("{:^25.2f}".format(3.1415926))#四舍五入
print("{:.5}".format("全国二级计算机考试"))#截取 全国二级计
'''
b:整数二进制形式
c:输出整数对应的Unicode字符
d:整数十进制形式
o:整数八进制形式
x:整数小写十六进制形式
X:整数大写十六进制形式
'''

print("{0:b},{0:c},{0:d},{0:o},{0:x},{0:X}".format(276))
#100010100,Ĕ,276,424,114,114

"""
e;浮点数对应的小写字母e的指数形式
E:浮点数对应的大写字母e的指数形式
f:标准浮点数
%:输出浮点数百分比的形式
"""
print("{0:e},{0:E},{0:f},{0:%}".format(3.141))
#3.141000e+00,3.141000E+00,3.141000,314.100000%












